
import App from "./App.js";
const game = new App();
game.startGame()


//     // playerTank.move();
//     /**
//      * это то самое место, где стоит делать основные шаги игрового цикла
//      * например, как нам кажется, можно было бы сделать следующее
//      * 1. передвинуть пули
//      * 2. рассчитать, где танки окажутся после этого шага
//      * 3. проверить столкновения (пуль с танками, пуль со стенами, танков со стенами и танков с танками)
//      * 4. убрать с поля мертвые танки и разрушенные стены
//      * 5. проверить, не закончились ли жизни у игрока или не закончиличь ли танки противника
//      * 6. создать новые танки на базах в случае, если кого-то убили на этом шаге
//      */
// }

// export { gameTimerInterval, playerTank };
